/*  Home Work 4_5
 Պետք է գրել ծրագիր հագուստի խանութում աշխատող աշխատակիցների աշխատավարձը հաշվելու համար։
 խանութում աշխատում է միայն վաճառողներ որոնց աշխատավարձը ամսեկան 200.000 դրամ է և պլուս այդ ամսում վաճառած հագուստի գումարի 3%-ը։
 փոփոխականաերի միջոցով պետք է հայտարարենք ՝ Վաճառողի անուն ազգանունը, այդ վաճառողի այդ ամսում վաճառած հագուստի ընդանուր գումարը։
 Ծրագիրը պետք է հաշվի այդ աշխատողի ընդանուր աշխատավարձը։
 Օրինակ՝
  Վաճառող՝ Աննա Համբարյան
  Վաճառողի ամսեկան Վաճառքը՝  1.000.000 դրամ
 ծրագիռրը պետք է տպի այդ վճառողի աշխատավարձը
        
  Աննա Համբարյան-ի աշխատավաձը կազմում է     230000 դրամ  (230000 -ը պետք է ստանաք որոշակի մաթեմատիկական գործողություներ կատարելու արդյունքում)
*/

var nameSurname: String = "Աննա Համբարյան"

var initialSalary: Int = 200000         // աշխատավարձը առանց %-ի
var monthlySalesAmount: Int = 1000000           // Վաճառողի ամսեկան Վաճառքը՝  1.000.000 դրամ
var monthlySalesAmountProcent: Int          // ամսում վաճառած հագուստի ընդանուր գումարի %-ը
var finalSalary: Int            // ընդանուր աշխատավարձը

monthlySalesAmountProcent = monthlySalesAmount * 3 / 100


finalSalary = initialSalary + monthlySalesAmountProcent


print("\(nameSurname)-ի աշխատավաձը կազմում է \(finalSalary) դրամ")

