/*  Home Work 4_2

 Տրված է a փոփոխականը որի տիպը Int է
 եթե a - ի արժեքը ընկած է  0 - ից 5 միջակաքում (0-ն և 5-ը ներառյալ) տպել -> “$$$.$$$”
 հակառակ դեպքում եթե a - ի արժեքը ընկած է  6 - ից 10 միջակաքում (6-ը և 10-ը ներառյալ) տպել -> “@@@.$$$”
 հակառակ դեպքում եթե a - ի արժեքը ընկած է  11 - ից 15 միջակաքում (11-ը և 15-ը ներառյալ) տպել -> “@@@.$$$.%%%”
 հակառակ դեպքում տպել  -> “@@@.@@@”

*/

var a: Int

a = 6

if a >= 0 && a <= 5 {
    print("$$$.$$$")
  
} else if a >= 6 && a <= 10 {
    print("@@@.$$$")
  
} else if a >= 11 && a <= 15 {
    print("@@@.$$$.%%%")
  
} else {
    print("@@@.@@@")
}
